Revit 2026 API

# CameraViewDirection Property

---

Direction that the camera is facing

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ViewDirection { get; set; }
```
```vb
Public Property ViewDirection As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ViewDirection : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace